package Lessons.lesson7;

//public class task7 {
//    public static void main(String[] args) {
//Написать программу, в которой пользователю предлогается ввести в консоль текст "Привет меня зовут Максим".
// Далее создать массив и записать каждое слово в отдельный элемент массива.
// Вывести в консоль строку из элементов массива в обратном порядке используя формулу  n-i-1.
//Каждое действие должно выполняться в отдельном методе! Т.е. В методе main только вызов пользовательских методов!
//        consoleOutput();
//        String textFromScanner = getInputString();
//        String[] arr = arrayFromStr();
//        String arrAfterReverse = reverseArray();
//        printArray();
//    }
//
//    private static void printArray(String[] arr) {
//        for (String array : arr) {
//            System.out.println(array);
//        }
//
//        private static String reverseArray (String[]arr){
//            String[] reverseArr = null;
//
//            String temp = null;
//            int count = arr.length;
//            for (int i = 0; i < count / 2; i++) {
//                temp = reverseArr[count - 1 - i] = [i];
//                reverseArr[i] = temp;
//            }
//            return reverseArr;
//        }
//
//    }
//
//    private static String[] arrayFromStr(String str) {
//        String[] arr = str.trim().split(" ");
//        return arr;
//    }
//
//    private static String getInputString() {
//        Scanner scanner = scanner.nextLine();
//        return text;
//    }
//
//    private static void consoleOutput() {
//        System.out.println("Привет меня зовут Максим");
//    }
//}
